namespace OnTheRoad.Data.Migrations
{
    using Models;
    using System.Data.Entity.Migrations;
    using System;
    using System.Collections.Generic;

    internal sealed class Configuration : DbMigrationsConfiguration<OnTheRoadIdentityDbContext>
    {
        public Configuration()
        {
            AutomaticMigrationsEnabled = true;
            AutomaticMigrationDataLossAllowed = true;
        }

        protected override void Seed(OnTheRoadIdentityDbContext context)
        {
            this.AddCities(context);

            //  This method will be called after migrating to the latest version.

            //  You can use the DbSet<T>.AddOrUpdate() helper extension method 
            //  to avoid creating duplicate seed data. E.g.
            //
            //    context.People.AddOrUpdate(
            //      p => p.FullName,
            //      new Person { FullName = "Andrew Peters" },
            //      new Person { FullName = "Brice Lambson" },
            //      new Person { FullName = "Rowan Miller" }
            //    );
            //
        }

        private void AddCities(OnTheRoadIdentityDbContext context)
        {
            var citiesList = new List<string>()
            {
                "Айтос","Аксаково","Алфатар","Антоново","Априлци","Ардино","Асеновград","Ахтопол","Балчик","Банкя","Банско","Баня","Батак","Батановци","Белене","Белица","Белово","Белоградчик","Белослав","Берковица","Благоевград","Бобовдол","Бобошево","Божурище","Бойчиновци","Болярово","Борово","Ботевград","Брацигово","Брегово","Брезник","Брезово","Брусарци","Бургас","Бухово","Българово","Бяла(ОбластВарна)","Бяла(ОбластРусе)","БялаСлатина","Бялачерква","Варна","ВеликиПреслав","ВеликоТърново","Велинград","Ветово","Видин","Враца","Вълчедръм","Вълчидол","Върбица","Вършец","Габрово","ГенералТошево","Главиница","Глоджево","Годеч","ГорнаОряховица","ГоцеДелчев","Грамада","Гулянци","Гурково","Гълъбово","Двемогили","Дебелец","Девин","Девня","Джебел","Димитровград","Димово","Добрич","ДолниЧифлик","ДолнаБаня","ДолнаМитрополия","ДолнаОряховица","ДолниДъбник","Доспат","Драгоман","Дряново","Дулово","Дунавци","Дупница","Дългопол","Елена","ЕлинПелин","Елхово","Етрополе","Завет","Земен","Златарица","Златица","Златоград","Ивайловград","Искър","Исперих","Ихтиман","Каблешково","Каварна","Казанлък","Калофер","Камено","Каолиново","Карлово","Карнобат","Каспичан","Кермен","Килифарево","Китен","Клисура","Кнежа","Козлодуй","Койнаре","Копривщица","Костенец","Костинброд","Котел","Кочериново","Криводол","Кричим","Крумовград","Кубрат","Куклен","Кула","Кърджали","Кюстендил","Левски","Летница","Ловеч","Лозница","Лом","Луковит","Лъки","Любимец","Лясковец","Мадан","Маджарово","МалкоТърново","Марица","Мартен","Мездра","Мелник","Меричлери","Мизия","Момчилград","Монтана","Мъглиж","Неделино","Несебър","Николаево","Никопол","НоваЗагора","НовиИскър","Новипазар","Обзор","Омуртаг","Опака","Оряхово","Павелбаня","Павликени","Пазарджик","Панагюрище","Перник","Перущица","Петрич","Пещера","Пирдоп","Плачковци","Плевен","Плиска","Пловдив","ПолскиТръмбеш","Поморие","Попово","Пордим","Правец","Приморско","Провадия","Първомай","Раднево","Радомир","Разград","Разлог","Ракитово","Раковски","Рила","Роман","Рудозем","Русе","Садово","Самоков","Сандански","Сапаревабаня","СветиВлас","Свиленград","Свищов","Своге","Севлиево","Сеново","Септември","Силистра","Симеоновград","Симитли","Славяново","Сливен","Сливница","Сливополе","Смолян","Смядово","Созопол","Сопот","София","Средец","Средногорие","Стамболийски","СтараЗагора","Стражица","Стралджа","Стрелча","Суворово","Сунгурларе","Сухиндол","Съединение","Сърница","Твърдица","Тервел","Тетевен","Тополовград","Троян","Трън","Тръстеник","Трявна","Тутракан","Търговище","Угърчин","Хаджидимово","Харманли","Хасково","Хисаря","Царево","ЦарКалоян","Чепеларе","Червенбряг","Чипровци","Чирпан","Шабла","Шивачево","Шипка","Шумен","Ябланица","Якоруда","Ямбол"
            };
            foreach (var city in citiesList)
            {
                context.Cities.AddOrUpdate(new City() { Name = city });
            }
        }
    }
}
