using System.Data.Entity.Migrations;
using System;
using System.Collections.Generic;
using OnTheRoad.Data.Contracts;
using OnTheRoad.Data.Seeders;
using OnTheRoad.Data.Models;

namespace OnTheRoad.Data.Migrations
{
    internal sealed class Configuration : DbMigrationsConfiguration<OnTheRoadIdentityDbContext>
    {
        private IDataSeeder dataSeeder;

        public Configuration()
        {
            AutomaticMigrationsEnabled = true;
            AutomaticMigrationDataLossAllowed = true;

            this.DataSeeder = new DataSeeder();
        }

        public IDataSeeder DataSeeder
        {
            get
            {
                return this.dataSeeder;
            }
            set
            {
                if (value == null)
                {
                    throw new ArgumentNullException("dataReader can not be null!");
                }

                this.dataSeeder = value;
            }
        }

        protected override void Seed(OnTheRoadIdentityDbContext context)
        {
            this.AddCities(context);

            this.dataSeeder.SeedCategories(context);

            //  This method will be called after migrating to the latest version.

            //  You can use the DbSet<T>.AddOrUpdate() helper extension method 
            //  to avoid creating duplicate seed data. E.g.
            //
            //    context.People.AddOrUpdate(
            //      p => p.FullName,
            //      new Person { FullName = "Andrew Peters" },
            //      new Person { FullName = "Brice Lambson" },
            //      new Person { FullName = "Rowan Miller" }
            //    );
            //
        }

        private void AddCities(OnTheRoadIdentityDbContext context)
        {
            var citiesList = new List<string>()
            {
                "Àéòîñ","Àêñàêîâî","Àëôàòàð","Àíòîíîâî","Àïðèëöè","Àðäèíî","Àñåíîâãðàä","Àõòîïîë","Áàë÷èê","Áàíêÿ","Áàíñêî","Áàíÿ","Áàòàê","Áàòàíîâöè","Áåëåíå","Áåëèöà","Áåëîâî","Áåëîãðàä÷èê","Áåëîñëàâ","Áåðêîâèöà","Áëàãîåâãðàä","Áîáîâäîë","Áîáîøåâî","Áîæóðèùå","Áîé÷èíîâöè","Áîëÿðîâî","Áîðîâî","Áîòåâãðàä","Áðàöèãîâî","Áðåãîâî","Áðåçíèê","Áðåçîâî","Áðóñàðöè","Áóðãàñ","Áóõîâî","Áúëãàðîâî","Áÿëà(ÎáëàñòÂàðíà)","Áÿëà(ÎáëàñòÐóñå)","ÁÿëàÑëàòèíà","Áÿëà÷åðêâà","Âàðíà","ÂåëèêèÏðåñëàâ","ÂåëèêîÒúðíîâî","Âåëèíãðàä","Âåòîâî","Âèäèí","Âðàöà","Âúë÷åäðúì","Âúë÷èäîë","Âúðáèöà","Âúðøåö","Ãàáðîâî","ÃåíåðàëÒîøåâî","Ãëàâèíèöà","Ãëîäæåâî","Ãîäå÷","ÃîðíàÎðÿõîâèöà","ÃîöåÄåë÷åâ","Ãðàìàäà","Ãóëÿíöè","Ãóðêîâî","Ãúëúáîâî","Äâåìîãèëè","Äåáåëåö","Äåâèí","Äåâíÿ","Äæåáåë","Äèìèòðîâãðàä","Äèìîâî","Äîáðè÷","Äîëíè×èôëèê","ÄîëíàÁàíÿ","ÄîëíàÌèòðîïîëèÿ","ÄîëíàÎðÿõîâèöà","ÄîëíèÄúáíèê","Äîñïàò","Äðàãîìàí","Äðÿíîâî","Äóëîâî","Äóíàâöè","Äóïíèöà","Äúëãîïîë","Åëåíà","ÅëèíÏåëèí","Åëõîâî","Åòðîïîëå","Çàâåò","Çåìåí","Çëàòàðèöà","Çëàòèöà","Çëàòîãðàä","Èâàéëîâãðàä","Èñêúð","Èñïåðèõ","Èõòèìàí","Êàáëåøêîâî","Êàâàðíà","Êàçàíëúê","Êàëîôåð","Êàìåíî","Êàîëèíîâî","Êàðëîâî","Êàðíîáàò","Êàñïè÷àí","Êåðìåí","Êèëèôàðåâî","Êèòåí","Êëèñóðà","Êíåæà","Êîçëîäóé","Êîéíàðå","Êîïðèâùèöà","Êîñòåíåö","Êîñòèíáðîä","Êîòåë","Êî÷åðèíîâî","Êðèâîäîë","Êðè÷èì","Êðóìîâãðàä","Êóáðàò","Êóêëåí","Êóëà","Êúðäæàëè","Êþñòåíäèë","Ëåâñêè","Ëåòíèöà","Ëîâå÷","Ëîçíèöà","Ëîì","Ëóêîâèò","Ëúêè","Ëþáèìåö","Ëÿñêîâåö","Ìàäàí","Ìàäæàðîâî","ÌàëêîÒúðíîâî","Ìàðèöà","Ìàðòåí","Ìåçäðà","Ìåëíèê","Ìåðè÷ëåðè","Ìèçèÿ","Ìîì÷èëãðàä","Ìîíòàíà","Ìúãëèæ","Íåäåëèíî","Íåñåáúð","Íèêîëàåâî","Íèêîïîë","ÍîâàÇàãîðà","ÍîâèÈñêúð","Íîâèïàçàð","Îáçîð","Îìóðòàã","Îïàêà","Îðÿõîâî","Ïàâåëáàíÿ","Ïàâëèêåíè","Ïàçàðäæèê","Ïàíàãþðèùå","Ïåðíèê","Ïåðóùèöà","Ïåòðè÷","Ïåùåðà","Ïèðäîï","Ïëà÷êîâöè","Ïëåâåí","Ïëèñêà","Ïëîâäèâ","ÏîëñêèÒðúìáåø","Ïîìîðèå","Ïîïîâî","Ïîðäèì","Ïðàâåö","Ïðèìîðñêî","Ïðîâàäèÿ","Ïúðâîìàé","Ðàäíåâî","Ðàäîìèð","Ðàçãðàä","Ðàçëîã","Ðàêèòîâî","Ðàêîâñêè","Ðèëà","Ðîìàí","Ðóäîçåì","Ðóñå","Ñàäîâî","Ñàìîêîâ","Ñàíäàíñêè","Ñàïàðåâàáàíÿ","ÑâåòèÂëàñ","Ñâèëåíãðàä","Ñâèùîâ","Ñâîãå","Ñåâëèåâî","Ñåíîâî","Ñåïòåìâðè","Ñèëèñòðà","Ñèìåîíîâãðàä","Ñèìèòëè","Ñëàâÿíîâî","Ñëèâåí","Ñëèâíèöà","Ñëèâîïîëå","Ñìîëÿí","Ñìÿäîâî","Ñîçîïîë","Ñîïîò","Ñîôèÿ","Ñðåäåö","Ñðåäíîãîðèå","Ñòàìáîëèéñêè","ÑòàðàÇàãîðà","Ñòðàæèöà","Ñòðàëäæà","Ñòðåë÷à","Ñóâîðîâî","Ñóíãóðëàðå","Ñóõèíäîë","Ñúåäèíåíèå","Ñúðíèöà","Òâúðäèöà","Òåðâåë","Òåòåâåí","Òîïîëîâãðàä","Òðîÿí","Òðúí","Òðúñòåíèê","Òðÿâíà","Òóòðàêàí","Òúðãîâèùå","Óãúð÷èí","Õàäæèäèìîâî","Õàðìàíëè","Õàñêîâî","Õèñàðÿ","Öàðåâî","ÖàðÊàëîÿí","×åïåëàðå","×åðâåíáðÿã","×èïðîâöè","×èðïàí","Øàáëà","Øèâà÷åâî","Øèïêà","Øóìåí","ßáëàíèöà","ßêîðóäà","ßìáîë"
            };

            foreach (var city in citiesList)
            {
                context.Cities.AddOrUpdate(new City() { Name = city });
            }
        }
    }
}
